use v5.14;
use warnings;
use Test::More 0.98;
use utf8;

use lib './t';
use ac;
use Text::ParseWords qw(shellwords);
use Data::Section::Simple qw(get_data_section);

for (
    't/YAMANASHI.txt -c80 -P10',
    't/YAMANASHI.txt -c80 -P10 -W',
    't/YAMANASHI.txt -c80 -P10 -C3',
    't/YAMANASHI.txt -c80 -P10 -C3 -D',
    't/YAMANASHI.txt -c80 -P10 -C3 -D --runin=4 --runout=4',
    't/YAMANASHI.txt t/YAMANASHI.txt -c80'

) {
    my $opt = $_;
    my $label = $opt =~ s/ /:/gr;
    my @opt = shellwords $opt;
    is(ac->new(@opt)->exec(), get_data_section($label), $opt);
}

done_testing

__DATA__

@@ t/YAMANASHI.txt:-c80:-P10
┌──────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ 　小さな谷川の底を写した二枚の青い幻燈です。                                                         │
│                                                                                                      │
│                                                                                                      │
│ 一、五月                                                                                             │
│                                                                                                      │
│ 　二疋の蟹の子供らが青じろい水の底で話していました。                                                 │
│ 『クラムボンはわらったよ。』                                                                         │
│ 『クラムボンはかぷかぷわらったよ。』                                                                 │
└──────────────────────────────────────────────────────────────────────────────────────────────────────┘
┌──────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ 『クラムボンは跳ねてわらったよ。』                                                                   │
│ 『クラムボンはかぷかぷわらったよ。』                                                                 │
│                                                                                                      │
│ 　泡と一緒に、白い樺の花びらが天井をたくさんすべって来ました。                                       │
│ 『こわいよ、お父さん。』弟の蟹も云いました。                                                         │
│                                                                                                      │
│                                                                                                      │
│ 二、十二月                                                                                           │
└──────────────────────────────────────────────────────────────────────────────────────────────────────┘
┌──────────────────────────────────────────────────────────────────────────────────────────────────────┐
│                                                                                                      │
│ 　蟹の子供らはもうよほど大きくなり、底の景色も夏から秋の間にすっかり変りました。                     │
│ 　白い柔かな円石もころがって来、小さな錐の形の水晶の粒や、金雲母のかけらもながれて来てとまりました。 │
│                                                                                                      │
│                                                                                                      │
│                                                                                                      │
│                                                                                                      │
│                                                                                                      │
└──────────────────────────────────────────────────────────────────────────────────────────────────────┘
@@ t/YAMANASHI.txt:-c80:-P10:-W
┌──────────────────────────────────────────────────────────────────────────────┐
│ 　小さな谷川の底を写した二枚の青い幻燈です。                                 │
│                                                                              │
│                                                                              │
│ 一、五月                                                                     │
│                                                                              │
│ 　二疋の蟹の子供らが青じろい水の底で話していました。                         │
│ 『クラムボンはわらったよ。』                                                 │
│ 『クラムボンはかぷかぷわらったよ。』                                         │
└──────────────────────────────────────────────────────────────────────────────┘
┌──────────────────────────────────────────────────────────────────────────────┐
│ 『クラムボンは跳ねてわらったよ。』                                           │
│ 『クラムボンはかぷかぷわらったよ。』                                         │
│                                                                              │
│ 　泡と一緒に、白い樺の花びらが天井をたくさんすべって来ました。               │
│ 『こわいよ、お父さん。』弟の蟹も云いました。                                 │
│                                                                              │
│                                                                              │
│ 二、十二月                                                                   │
└──────────────────────────────────────────────────────────────────────────────┘
┌──────────────────────────────────────────────────────────────────────────────┐
│                                                                              │
│ 　蟹の子供らはもうよほど大きくなり、底の景色も夏から秋の間にすっかり変りまし │
│ た。                                                                         │
│ 　白い柔かな円石もころがって来、小さな錐の形の水晶の粒や、金雲母のかけらもな │
│ がれて来てとまりました。                                                     │
│                                                                              │
│                                                                              │
│                                                                              │
└──────────────────────────────────────────────────────────────────────────────┘
@@ t/YAMANASHI.txt:-c80:-P10:-C3
┌────────────────────────┐┌────────────────────────┐┌────────────────────────┐
│ 　小さな谷川の底を写し ││ ました。               ││ わらったよ。』         │
│ た二枚の青い幻燈です。 ││ 『クラムボンはわらった ││                        │
│                        ││ よ。』                 ││ 　泡と一緒に、白い樺の │
│                        ││ 『クラムボンはかぷかぷ ││ 花びらが天井をたくさん │
│ 一、五月               ││ わらったよ。』         ││ すべって来ました。     │
│                        ││ 『クラムボンは跳ねてわ ││ 『こわいよ、お父さん。 │
│ 　二疋の蟹の子供らが青 ││ らったよ。』           ││ 』弟の蟹も云いました。 │
│ じろい水の底で話してい ││ 『クラムボンはかぷかぷ ││                        │
└────────────────────────┘└────────────────────────┘└────────────────────────┘
┌────────────────────────┐┌────────────────────────┐
│                        ││ がって来、小さな錐の形 │
│ 二、十二月             ││ の水晶の粒や、金雲母の │
│                        ││ かけらもながれて来てと │
│ 　蟹の子供らはもうよほ ││ まりました。           │
│ ど大きくなり、底の景色 ││                        │
│ も夏から秋の間にすっか ││                        │
│ り変りました。         ││                        │
│ 　白い柔かな円石もころ ││                        │
└────────────────────────┘└────────────────────────┘
@@ t/YAMANASHI.txt:-c80:-P10:-C3:-D
┌────────────────────────┐┌────────────────────────┐┌────────────────────────┐
│ 　小さな谷川の底を写   ││ 　二疋の蟹の子供らが   ││ わらったよ。』         │
│ した二枚の青い幻燈で   ││ 青じろい水の底で話し   ││ 『クラムボンはかぷか   │
│ す。                   ││ ていました。           ││ ぷわらったよ。』       │
│                        ││ 『クラムボンはわらっ   ││                        │
│                        ││ たよ。』               ││ 　泡と一緒に、白い樺   │
│ 一、五月               ││ 『クラムボンはかぷか   ││ の花びらが天井をたく   │
│                        ││ ぷわらったよ。』       ││ さんすべって来ました。 │
│                        ││ 『クラムボンは跳ねて   ││ 『こわいよ、お父さん。 │
└────────────────────────┘└────────────────────────┘└────────────────────────┘
┌────────────────────────┐┌────────────────────────┐
│ 』弟の蟹も云いました。 ││ すっかり変りました。   │
│                        ││ 　白い柔かな円石もこ   │
│                        ││ ろがって来、小さな錐   │
│ 二、十二月             ││ の形の水晶の粒や、金   │
│                        ││ 雲母のかけらもながれ   │
│ 　蟹の子供らはもうよ   ││ て来てとまりました。   │
│ ほど大きくなり、底の   ││                        │
│ 景色も夏から秋の間に   ││                        │
└────────────────────────┘└────────────────────────┘
@@ t/YAMANASHI.txt:-c80:-P10:-C3:-D:--runin=4:--runout=4
┌────────────────────────┐┌────────────────────────┐┌────────────────────────┐
│ 　小さな谷川の底を     ││ 　二疋の蟹の子供ら     ││ てわらったよ。』       │
│ 写した二枚の青い幻     ││ が青じろい水の底で     ││ 『クラムボンはかぷ     │
│ 燈です。               ││ 話していました。       ││ かぷわらったよ。』     │
│                        ││ 『クラムボンはわらっ   ││                        │
│                        ││ たよ。』               ││ 　泡と一緒に、白い     │
│ 一、五月               ││ 『クラムボンはかぷ     ││ 樺の花びらが天井を     │
│                        ││ かぷわらったよ。』     ││ たくさんすべって来     │
│                        ││ 『クラムボンは跳ね     ││ ました。               │
└────────────────────────┘└────────────────────────┘└────────────────────────┘
┌────────────────────────┐┌────────────────────────┐┌────────────────────────┐
│ 『こわいよ、お父さ     ││ 　蟹の子供らはもう     ││ や、金雲母のかけら     │
│ ん。』弟の蟹も云い     ││ よほど大きくなり、     ││ もながれて来てとま     │
│ ました。               ││ 底の景色も夏から秋     ││ りました。             │
│                        ││ の間にすっかり変り     ││                        │
│                        ││ ました。               ││                        │
│ 二、十二月             ││ 　白い柔かな円石も     ││                        │
│                        ││ ころがって来、小さ     ││                        │
│                        ││ な錐の形の水晶の粒     ││                        │
└────────────────────────┘└────────────────────────┘└────────────────────────┘
@@ t/YAMANASHI.txt:t/YAMANASHI.txt:-c80
┌──────────────────────────────────────┐┌──────────────────────────────────────┐
│ 　小さな谷川の底を写した二枚の青い幻 ││ 　小さな谷川の底を写した二枚の青い幻 │
│ 燈です。                             ││ 燈です。                             │
│                                      ││                                      │
│                                      ││                                      │
│ 一、五月                             ││ 一、五月                             │
│                                      ││                                      │
│ 　二疋の蟹の子供らが青じろい水の底で ││ 　二疋の蟹の子供らが青じろい水の底で │
│ 話していました。                     ││ 話していました。                     │
│ 『クラムボンはわらったよ。』         ││ 『クラムボンはわらったよ。』         │
│ 『クラムボンはかぷかぷわらったよ。』 ││ 『クラムボンはかぷかぷわらったよ。』 │
│ 『クラムボンは跳ねてわらったよ。』   ││ 『クラムボンは跳ねてわらったよ。』   │
│ 『クラムボンはかぷかぷわらったよ。』 ││ 『クラムボンはかぷかぷわらったよ。』 │
│                                      ││                                      │
│ 　泡と一緒に、白い樺の花びらが天井を ││ 　泡と一緒に、白い樺の花びらが天井を │
│ たくさんすべって来ました。           ││ たくさんすべって来ました。           │
│ 『こわいよ、お父さん。』弟の蟹も云い ││ 『こわいよ、お父さん。』弟の蟹も云い │
│ ました。                             ││ ました。                             │
│                                      ││                                      │
│                                      ││                                      │
│ 二、十二月                           ││ 二、十二月                           │
│                                      ││                                      │
│ 　蟹の子供らはもうよほど大きくなり、 ││ 　蟹の子供らはもうよほど大きくなり、 │
│ 底の景色も夏から秋の間にすっかり変り ││ 底の景色も夏から秋の間にすっかり変り │
│ ました。                             ││ ました。                             │
│ 　白い柔かな円石もころがって来、小さ ││ 　白い柔かな円石もころがって来、小さ │
│ な錐の形の水晶の粒や、金雲母のかけら ││ な錐の形の水晶の粒や、金雲母のかけら │
│ もながれて来てとまりました。         ││ もながれて来てとまりました。         │
└──────────────────────────────────────┘└──────────────────────────────────────┘
